CDMDEV.RSN_/src/Catalogs/um_ОбъектыМетаданных/um_ОбъектыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>um_ОбъектыМетаданных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйЗапрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИменаТабличныхЧастей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИменаРеквизитовТипаДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныеТипы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоляПоискаРеквизитов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПриЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

CDMDEV.RSN_/src/Catalogs/um_ОбъектыМетаданных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаВТаблицуФормы("ИменаТабличныхЧастей");
	СтрокаВТаблицуФормы("ИменаРеквизитовТипаДата");
	
	СтрокаJsonВТаблицуФормы("СсылочныеТипы");
	СтрокаJsonВТаблицуФормы("ПоляПоискаРеквизитов"); 
	
	Элементы.ПояснениеКДопОбработчикам.Заголовок =
	"Для инициации доп. обработчиков, в теле запроса к сервису необходимо передать структуру ""ДопОбработчики[ВидОбрабочика]""
	|В дополнительных обработчиках используются следующие переменные: 
	|- ""ОбрабатываемыйОбъект"" - обрабатываемый элемент объекта метаданных;
	|- ""ВидОбработчика"" - строка - значения: ""ПередЗаписью"" или ""ПриЗаписи"";
	|- ""ПараметрыОбъекта"" - структура - ""техническая"" информация по объекту из справочника ""um_ОбъектыМетаданных"";
	|- ""РеквизитыЗапроса"" - структура - реквизиты, переданные в теле запроса к сервису";
	
КонецПроцедуры    

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаФормыВСтроку("ИменаТабличныхЧастей", ТекущийОбъект);
	ТаблицаФормыВСтроку("ИменаРеквизитовТипаДата", ТекущийОбъект);
	
	ТаблицаФормыВJson("СсылочныеТипы", ТекущийОбъект);        
	ТаблицаФормыВJson("ПоляПоискаРеквизитов", ТекущийОбъект);        
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура СтрокаВТаблицуФормы(ИмяРеквизита)
	
	Если Не Объект[ИмяРеквизита] = "" Тогда
		
		Значения = СтрРазделить(Объект[ИмяРеквизита], ",",Ложь);
		Для Каждого Стр Из Значения Цикл
			НовСтр = ЭтотОбъект[ИмяРеквизита].Добавить();
			НовСтр.Имя = Стр; 
		КонецЦикла;	
		
	КонецЕсли;	

КонецПроцедуры  

&НаСервере
Процедура СтрокаJsonВТаблицуФормы(ИмяРеквизита)
	            	
	Если Не Объект[ИмяРеквизита] = "" Тогда     
		
		Значения = um_httpСервис.JSONПрочитать(Объект[ИмяРеквизита]); 	
		Для Каждого Стр Из Значения Цикл
			НовСтр = ЭтотОбъект[ИмяРеквизита].Добавить();
			НовСтр.ИмяРеквизита = Стр.Ключ; 
			НовСтр.Тип = Стр.Значение; 
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТаблицаФормыВСтроку(ИмяРеквизита, ТекущийОбъект)
	
	Значения = Новый Массив;
	Для Каждого Стр Из ЭтотОбъект[ИмяРеквизита] Цикл  
		Если Не ЗначениеЗаполнено(Стр.Имя) Тогда
			Продолжить;
		КонецЕсли;
		Значения.Добавить(СокрЛП(Стр.Имя));	
	КонецЦикла;
	ТекущийОбъект[ИмяРеквизита] = СтрСоединить(Значения, ",");	

КонецПроцедуры

&НаСервере
Процедура ТаблицаФормыВJson(ИмяРеквизита, ТекущийОбъект)
	
	Значения = Новый Структура;
	Для Каждого Стр Из ЭтотОбъект[ИмяРеквизита] Цикл  
		Если Не ЗначениеЗаполнено(Стр.ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		Значения.Вставить(СокрЛП(Стр.ИмяРеквизита), СокрЛП(Стр.Тип));	
	КонецЦикла;   
	ТекущийОбъект[ИмяРеквизита] = um_httpСервис.JSONЗаписать(Значения);

КонецПроцедуры

 #КонецОбласти
